GLM-4.6/benchmark_GLM-4.6_1k1k_conc_4.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=1024, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=4, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='0.0.0.0', port=8000, dataset_name='random', dataset_path='', model='/models/GLM-4.6-FP8', served_model_name=None, tokenizer=None, num_prompts=1024, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=4, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

Downloading from https://huggingface.co/datasets/anon8231489123/ShareGPT_Vicuna_unfiltered/resolve/main/ShareGPT_V3_unfiltered_cleaned_split.json to /tmp/ShareGPT_V3_unfiltered_cleaned_split.json
/tmp/ShareGPT_V3_unfiltered_cleaned_split.json: 100%|██████████| 642M/642M [00:04<00:00, 165MB/s]
#Input tokens: 1048576
#Output tokens: 1048576
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1024/1024 [1:23:16<00:00,  4.88s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     1024      
Benchmark duration (s):                  4996.06   
Total input tokens:                      1048576   
Total input text tokens:                 1048576   
Total input vision tokens:               0         
Total generated tokens:                  1048576   
Total generated tokens (retokenized):    1047771   
Request throughput (req/s):              0.20      
Input token throughput (tok/s):          209.88    
Output token throughput (tok/s):         209.88    
Total token throughput (tok/s):          419.76    
Concurrency:                             4.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   19514.95  
Median E2E Latency (ms):                 19486.30  
---------------Time to First Token----------------
Mean TTFT (ms):                          279.18    
Median TTFT (ms):                        240.90    
P99 TTFT (ms):                           527.05    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           18.80     
Median ITL (ms):                         18.81     
P95 ITL (ms):                            18.91     
P99 ITL (ms):                            18.98     
Max ITL (ms):                            296.56    
==================================================